###　処理


1. 入力デバイスを通して処理を依頼
2. メモリにある命令を読み出して、CPUにおいて実行、メモリ上に書き込む
3. メモリのデータをストレージに書き込む

### デバイスドライバ
* プロセスがデバイスにアクセスするためのプログラム
* CPUがカーネルモードで動作してる時のみ、デバイスにアクセスできる

### プログラム
* （CPUが）カーネルモードで動作するプログラム＝カーネル
　: デバイスドライバ、プロセス管理システム、プロセススケジューラ
*  (CPUが) ユーザーモードで動作するプログラム＝プロセス
  * プロセスがカーネルの機能を使いたい時、カーネルの助けが必要なときはシステムコールでカーネルに依頼
  * システムコールを発行するとCPUで<b>割り込み</b>が発生,<br>
  CPUはユーザーモードからカーネルモードに遷移


### OS＝カーネル＋ユーザーモードで動作する様々なプログラム
* ユーザーモードで動作する様々なプログラム＝ライブラリや単独のプロセス

### システムコール
ex) write() : データを画面やファイルに出力する
* 質問: c言語のプログラムとpythonのプログラム、システムコール
発行数の違い→どれに対応してどのシステムコールをするというのは、

##プログラムの流れ
* 高級言語のプログラム（C言語）→アセンブリ言語のシステムコール呼び出しプログラム（OSが提供するシステムコールのラッパー関数：アーキテクチャごとに存在）→カーネル（システムコール〜番の処理、openとか、をする。）
  * システムコールのラッパー関数: 例えば、glibcに含まれる
* 例: スクリーンショット

### fork関数
実行中のプロセスを複製する。clone()というシステムコールを呼び出している。

### exec関数
他のプログラムに変身する。catを実行する時、forkしてexec

参考）https://www.slideshare.net/yusukesangenya/ss-135407412

###次やりたいこと: lsのソースコードをみる、bashにforkが含まれているかみる。



　
